In [1]:
import pandas as pd
student_data = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])

https://www.w3resource.com/python-exercises/pandas/groupby/index.php

Write a Pandas program to split the following dataframe into groups based on school code. Also check the type of GroupBy object.

In [11]:
student_data_grouped_by_school = student_data.groupby(by = ['school_code'])
student_data_grouped_by_school.head()

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

In [13]:
for group, name in student_data_grouped_by_school:
    print("%s, %s"%(group, name))

s001,    school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35
S4        s001    VI    Eesha Hinton     25/09/1998   13     167      30

    address
S1  street1
S4  street1
s002,    school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2
s003,    school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3
s004,    school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

In [ ]:
type(student_data_grouped_by_school)#%%

Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school

In [18]:
age = {}
age['mean'] = student_data_grouped_by_school['age'].mean()
age['min'] = student_data_grouped_by_school['age'].min()
age['max'] = student_data_grouped_by_school['age'].max()
print(age)

{'mean': school_code
s001    12.5
s002    13.0
s003    13.0
s004    12.0
Name: age, dtype: float64, 'min': school_code
s001    12
s002    12
s003    13
s004    12
Name: age, dtype: int64, 'max': school_code
s001    13
s002    14
s003    13
s004    12
Name: age, dtype: int64}